tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

# Essential tools
brew "git"
brew "git-flow"
brew "curl"
brew "coreutils"
brew "gawk"

# Development tools
brew "asdf"
brew "sheldon"
brew "python@3.11"
brew "mysql"
brew "sqlite"

# System utilities
brew "autoconf"
brew "automake"
brew "libtool"
brew "gnupg"
brew "pinentry"
brew "unzip"
brew "zsh-completions"

# Libraries
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "zlib"
brew "libgit2"
brew "protobuf"

# Casks
cask "google-cloud-sdk"
cask "stats"